# Задание:
# Создайте пустое множество и сохраните его в переменную my_set, затем выведите на экран эту переменную

# Решение:
my_set = set()
print(my_set)