# Задание:
# Давайте начнем с легкого примера. Создадим функцию с именем keanu_reeves, которая выводит сообщение
# "YOU'RE BREATHTAKING"
# Ваша задача написать только определение функции keanu_reeves

# Решение:
def keanu_reeves():
    print("YOU'RE BREATHTAKING")