# Задание:
# Всеми любимая программа «hello world». Создайте функцию с именем say_hello_world ,
# которая принимает на вход имя человека в виде строки и печатает фразу «{name} говорит hello world!»
# Ваша задача написать только определение функции say_hello_world

# Решение:
def say_hello_world(name):
    print(f'{name} говорит hello world!')
