# Задача:
# 7. Проверить является ли массив подмножеством другого массива
# l1 = [1,4,6]
# l2 = [9,5,1,10,4,33,2,6,0,8]

# Решение:
l1 = [1, 4, 6]
check = len(l1)
l2 = [9, 5, 1, 10, 4, 33, 2, 6, 0, 8]
count = 0
while l1:
    if l1[0] == l2[0]:
        l1.pop(0)
        l2.pop(0)
        count += 1
    else:
        l2.pop(0)
if count == check:
    print("l1 является подмножеством l2")
else:
#     print("l1 не является подмножеством l2")

# Альтернатива (not mine)
# l1 = [1, 4, 6]
# l2 = [9, 5, 1, 10, 4, 33, 2, 6, 0, 8]
# count = 0
# for i in l1:
#     if i in l2:
#         count += 1
# print(count == len(l1))
