# Задача:
# 3. Все чётные числа вывести в другой список
# l = [1,3,4,5,8,9,10,44,22,50,79,54,28,91]

# Решение:
l = [1, 3, 4, 5, 8, 9, 10, 44, 22, 50, 79, 54, 28, 91]
a = []
for i in range(len(l)):
    if l[i] % 2 == 0:
        a.append(l[i])
print(a)
