# Задача:
# «Надо было брать биткоин в 2012!»
# именно такую фразу ваша программа должна вывести на экран 13 раз

# Решение:
for i in range(13):
    print("Надо было брать биткоин в 2012!")

# Альтернатива (not mine)
